Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F44C.tmx
Source language: en_us
Languages: zh_cn

source: Aquarius Traits
zh_cn: 水瓶座的特性

source: Aquarius traits are a mix of friendly, outgoing nature and with a sense of high originality and idealism.
zh_cn: 水瓶座的特性，是一种融合了友善的天然的率真，拥有脱俗的创造力，并且是独特的理想主义者。

source: In this article, know more about the same.
zh_cn: 从下文来了解水瓶的更多性格特点吧。

source: One of the most interesting, erratic and yet brilliant people are the Aquarians.
zh_cn: 有趣的是，许多的奇怪的但又相当聪明的人都是水瓶座。

source: Born between January 20th and February 19th, Aquarius sign people are ruled by the planet Saturn.
zh_cn: 水瓶座的人出生在1月20日到2月19日，标示着水瓶座的人是由土星掌控。

source: The water bearer symbol of the creative genius Aquarius, that shows the identity of a man pouring forth water from a jug symbolizes the human community.
zh_cn: 水的持有者就是有着不同凡响的创造力的水瓶座，以一个人的形象将宝瓶中的水缓缓倾泻下来，而宝瓶则代表了人类社会。

source: One of the lesser known facts about this zodiac sign is that Aquarius is an intellectual air sign and not a water sign.
zh_cn: 一个不被大家所熟知的事实是水瓶座其实是一个智慧的风象星座，而不是水象星座。

source: Aquarius traits are a bag full of several interesting personality traits.
zh_cn: 水瓶座人的特性中融合了许多有趣的特点。

source: They can talk to you on several topics, can hold intellectual discussions but can become uncomfortable if you start discussing their feelings.
zh_cn: 他们可以与你讨论各种不同的话题，开展巧妙的讨论，但如果你开始讨论他的想法感觉，那么他就会感到很不舒服。

source: Characteristics and Features of Aquarius
zh_cn: 水瓶座的特点与性格

source: Aquarius traits and personality are dominated by air element.
zh_cn: 水瓶座的人表现出来的个性与是由风象元素所决定的。

source: According to astrology, air represents dynamism, motion and movement.
zh_cn: 从占星学上可以了解风象星座表现为活力，激情，行动力。

source: One of the most important Aquarius traits that is inherent in their personality is that they're born communicators.
zh_cn: 水瓶座最重要的一个特点就是他们是天生的组织者。

source: Intellectual thinking is emphasized over other works and their words can convey power, grace and force.
zh_cn: 聪颖的思维就压倒了所有，而且他们的话语中就传递着力量，风度和气势。

source: A general command over language and an ability to be a very good communicator is one of the most evident signs of their personality.
zh_cn: 水瓶座的最明显的特点就是语言上的表达能力和天生的成为组织者能力。

source: The characteristics of Aquarius zodiac sign that can often be observed in Aquarian personality is that they can be enthusiastic, edgy and highly idealistic at times and sometimes they can turn introvert, shy and less talkative.
zh_cn: 水瓶座的人特点表现出来就是热情，敏锐，有时会表现出高度的理想主义，有时又会变的内向，害羞，少言少语。

source: Although, brimming with ideas, they also want to explore extrovert and materialistic lives.
zh_cn: 尽管有满脑子念头，水瓶座的人还是希望深入到外在的现实的社会中。

source: Often, they tend to sit back and dive in their inner lives, to find a balance between the external and internal.
zh_cn: 他们经常生活在自己的内心里，寻找着与外部世界的一种平衡。

source: The likes and dislikes of an Aquarius personality are very rigid.
zh_cn: 水瓶的喜好很顽固。

source: It's difficult for an Aquarian to change his/her mind, once they've taken a decision.
zh_cn: 只要是水瓶们决定的事，很难改变。

source: Aquarius Characteristics: Male
zh_cn: 水瓶男的特性

source: One of the personality characteristics of a Aquarius male is that he is an unpredictable guy, confident and yet prefers to be silent in a group.
zh_cn: 水瓶男是不可预知的，自信的，在一个集体中会显得安静。

source: Amidst a group of people, he keeps himself reserved and is a master in concealing his truer self.
zh_cn: 他们会在群体中保留自己的意见，把自己的真实想法隐藏起来。

source: Quick witted and funny, Aquarian males love to be in close, passionate and intimate relationships.
zh_cn: 因为反应灵活并且幽默，水瓶男喜欢一种亲近的，有激情的，亲密的关系。

source: Aquarius love to be with friendly people who are fun loving and have some flair for intellectual thinking.
zh_cn: 如果你很好奇水瓶会和什么样的人在一起，答案就是那些友好的，爱玩的，天资聪颖喜欢思考的人。

source: An Aquarius man in love expects his partner to give him plenty of space but then he doesn't want her to be away for long time.
zh_cn: 一个水瓶座的男生只会爱上给他足够自由空间的人，但又不希望她离太远。

source: Also, he doesn't fall in love easily.
zh_cn: 水瓶男的另一个特性就是容易陷入爱情。

source: Being an intellectual thinker, he gives himself sufficient time to know a partner and only then he commits to her.
zh_cn: 作为一个有思想的人，他会给自己足够的时间来确定自己的伴侣，才会决定给她承诺。

source: Aquarius man go easily along with zodiac signs like Libra and Gemini, as they're most compatible with Aquarius sign.
zh_cn: 水瓶座的人和天秤座、双子座的人很容易相处，因为他们都和水瓶很像。

source: Most importantly, although Aquarius man may not appear very caring, they're certainly very true and loyal to their partners.
zh_cn: 最重要的是水瓶男可能不会表现出自己的关心，但他们确实对伴侣非常的真诚，忠诚。

source: Aquarius Characteristics: Female
zh_cn: 水瓶女的特性

source: Self controlled, honest and sensible - these are the very few Aquarius traits that define an Aquarian women.
zh_cn: 极少用有自制力，诚实，敏感来形容一个水瓶女。

source: With a charming smile, she is friendly, outgoing and loved by friends.
zh_cn: 拥有着迷人微笑的水瓶女是友好的，大方的并且很受朋友的喜爱。

source: Laughter and smiles are an integral part of her life and she can't remain sad all the time.
zh_cn: 笑声和笑容是水瓶女生活的全部，她们不会一直处在悲伤中。

source: She may not be one of the best homemakers but certainly, she is very popular in the social circle.
zh_cn: 她可能不是最会适合当主妇的，但确是在交际圈中最受欢迎的。

source: These women in love have a great respect for loyalty and honesty in relationships.
zh_cn: 水瓶女很重视爱情中的忠诚和诚实。

source: In fact, one of the prime features of people belonging to this zodiac sign is that both the partners hold high regards for loyalty and trust.
zh_cn: 事实上，水瓶女的爱情中最重要的特征就是双方都有着绝对的忠实和信任。

source: An Aquarius woman finds it difficult to forgive people, if she is hurt, even once.
zh_cn: 水瓶女如果受伤很难原谅他人，哪怕只有一次。

source: Personality traits of an Aquarius man or woman are common when it comes to the outgoing nature, friendly disposition and seriousness in relationships.
zh_cn: 水瓶男女表现的在外向，友善，认真上是相同的。

source: Owing to their communication skills, they can be very understanding and happy with their partners.
zh_cn: 因为他们的与人交流的能力，他们对伴侣非常理解，在一起也很开心。

source: The zodiac sign Aquarius represents a personality full of life, zeal and extrovert qualities.
zh_cn: 水瓶宫在星座上是特性是充满了生命力，热情和外向开朗。

source: Aquarius traits make the personality of an Aquarian richer and he is known to be an interesting person in any group.
zh_cn: 水瓶的特性使水瓶座的人感情更加丰富，众所周知，在任何群体中都是个有意思的人。

source: They're certainly someone who're easy to get along with and to be made great friends.
zh_cn: 当然，他们会是一个好相处并且值得交的朋友。
